"CIAdditionCompositing" = "색상 구성요소를 추가하여 밝아지는 효과를 냅니다. 이 필터는 일반적으로 하이라이트 및 렌즈 플레어 효과를 추가하는데 사용됩니다.";"CIAffineClamp" = "소스 이미지에서 어파인 변형을 실행한 다음 픽셀을 밖으로 확장시켜 주는 변형된 이미지의 가장자리에 있는 픽셀을 고정시킵니다. 이 필터는 이미지를 무한한 크기로 늘리는 경우를 제외하면 어파인 변형(CIAffineTransform) 필터와 비슷하게 실행됩니다. 이미지에 흐림 효과를 주어야 하지만 가장자리를 부드럽게 하거나 검은 프린지를 피하고 싶을 때 이 필터를 사용할 수 있습니다.";"CIAffineTile" = "어파인 변형을 이미지에 적용한 다음 변형된 이미지를 타일링 합니다.";"CIAffineTransform" = "이미지에 어파인 변형을 적용합니다. 입력 이미지를 크기 조절, 변환 또는 회전할 수 있습니다. 또한 이 동작들의 조합을 적용할 수 있습니다.";"CIBarsSwipeTransition" = "전경 이미지의 사각형 부분을 스윕한 다음 하나의 이미지를 다른 이미지로 변환하여 대상 이미지를 나타냅니다.";"CIBlendWithMask" = "흑백음영 마스크 값을 사용하여 이미지와 배경 사이에 삽입합니다. 마스크 값이 0.0이면, 그 결과는 배경입니다. 마스크 값이 1.0이면, 그 결과는 이미지입니다.";"CIBloom" = "가장자리를 부드럽게하고 풍부한 조명을 이미지에 적용합니다.";"CIBoxBlur" = "상자 모양의 나선 효과 커널을 사용하여 이미지를 부드럽게 또는 선명하게 만듭니다.";"CIBumpDistortion" = "이미지에 있는 지정된 포인트에서 시작되는 오목 또는 볼록 범프를 생성합니다.";"CIBumpDistortionLinear" = "이미지의 선형 부분에서 만들어지는 범프를 생성합니다.";"CICMYKHalftone" = "흰색 페이지 위에 시안, 마젠타, 노랑 및 검정 잉크를 사용하여 소스 이미지의 하프톤 랜디션 및 색상을 생성합니다.";"CICheckerboardGenerator" = "체커보드 패턴을 생성합니다. 체커보드 크기, 색상 및 패턴의 선명도를 지정할 수 있습니다.";"CICircleSplashDistortion" = "원의 둘레에서 시작하여 밖으로 확장되어 픽셀을 왜곡합니다.";"CICircularScreen" = "원 모양의 하프톤 화면을 시뮬레이션합니다.";"CICircularWrap" = "반투명 원 주변을 이미지로 둘러쌉니다. 이미지의 왜곡은 원 중심에서의 거리를 증가시킵니다.";"CIColorControls" = "채도, 밝기 및 대비 값을 조절합니다.";"CIColorCube" = "3차원 색상표를 사용하여 소스 이미지 픽셀을 변형합니다. 색상표는 미리 증대된 알파를 사용하는 부동 소수점 RGBA 셀로 구성되어야 합니다. 이 셀들은 표준 순서로 구성되었습니다. 데이터의 열과 행은 각각 빨강과 녹색으로 인덱스되었습니다. 각각의 데이터 플레인은 파랑으로 인덱스된 플레인과 함께 데이터에서 다음으로 높은 플레인을 따릅니다.";"CIColorInvert" = "이미지에서 색상을 반전합니다.";"CIColorMap" = "표에서 제공한 맵핑 값을 사용하여 소스 색상 값의 비선형 변형을 수행합니다.";"CIColorMatrix" = "소스 색상 값을 곱하고 바이어스 인자를 각각의 색상 구성요소에 추가합니다.";"CIColorMonochrome" = "색상을 재배치했기 때문에 단일 색상의 음영 범위에 포함됩니다.";"CIColorPosterize" = "빨강, 녹색 및 파랑 색상 구성요소를 각각의 색상 구성요소에 대해 지정한 밝기 값에 재배치합니다. 이 필터는 색상을 결합하여 실크 화면 포스터와 비슷한 색상의 모양을 만듭니다.";"CIComicEffect" = "가장자리의 윤곽을 그리고 색상 하프톤 효과를 적용하여 만화책과 같이 시뮬레이션합니다.";"CIConstantColorGenerator" = "단일 색상을 생성합니다. 일반적으로 다른 필터의 입력값으로 이 필터의 결과를 사용합니다.";"CICopyMachineTransition" = "복사기의 효과를 시뮬레이션하여 하나의 이미지를 다른 이미지로 변환합니다.";"CICrop" = "이미지에 자르기를 적용합니다. 잘려진 이미지의 크기와 모양은 사용자가 지정한 사각형에 기반합니다.";"CICrystallize" = "소스 픽셀 색상 값을 결집시켜서 폴리곤 모양의 색상 블록을 생성합니다.";"CIDiscBlur" = "디스크 모양의 나선 효과 커널을 사용하여 이미지를 부드럽게 또는 선명하게 만듭니다.";"CIDisintegrateWithMaskTransition" = "마스크로 정의된 모양을 사용하여 하나의 이미지를 다른 이미지로 변환합니다.";"CIDisplacementDistortion" = "두번째 이미지의 흑백음영 값을 첫번째 이미지에 적용합니다. 출력 이미지은 흑백음영 값으로 정의된 텍스쳐를 가집니다.";"CIDissolveTransition" = "하나의 이미지에서 다른 이미지로 변환되는데 디졸브를 사용합니다.";"CIDotScreen" = "하프톤 화면의 도트 패턴을 시뮬레이션합니다.";"CIEdges" = "이미지에 있는 모든 가장자리를 찾아서 색상으로 표시합니다.";"CIEdgeWork" = "우드 블록 컷아웃과 비슷한 모양의 이미지를 가진 스타일화된 흑백 랜디션을 만듭니다.";"CIEightfoldReflectedTile" = "8방향 반사 대칭을 적용하여 소스 이미지에서 타일된 이미지를 만듭니다.";"CIExposureAdjust" = "F-스톱을 변경할 때 카메라 노출을 제어하는 것과 비슷한 방법으로 이미지에 대한 노출 설정을 조절합니다.";"CIFalseColor" = "휘도를 두 가지 색상의 색상 램프로 매핑합니다. 적외선 사진 효과는 자외선 및 엑스레이 이미지와 같은 천문학 및 기타 과학 데이터를 처리한는데 종종 사용됩니다.";"CIFastBoxBlur" = "상자 모양의 나선 효과 커널을 사용하여 이미지를 부드럽게 또는 선명하게 만듭니다.";"CIFastDiscBlur" = "디스크 모양의 나선 효과 커널을 사용하여 이미지를 부드럽게 또는 선명하게 만듭니다.";"CIFlashTransition" = "플래시를 생성하여 하나의 이미지에서 다른 이미지로 변환합니다. 해당 플래시는 사용자가 지정한 포인트에서 만들어 집니다. 처음에는 작지만, 이미지 프레임이 플래시 색상을 완전히 가득 채울 때까지 급격하게 확장됩니다. 색상이 페이드되면, 이미지가 나타나기 시작합니다.";"CIFourfoldReflectedTile" = "4방향 반사 대칭을 적용하여 소스 이미지에서 타일된 이미지를 만듭니다.";"CIFourfoldRotatedTile" = "90도 각도로 소스를 회전하여 소스 이미지에서 타일된 이미지를 만듭니다.";"CIFourfoldTranslatedTile" = "4개의 변환 동작을 적용하여 소스 이미지에서 타일된 이미지를 만듭니다.";"CIGammaAdjust" = "중간 밝기를 조절합니다. 이 필터는 일반적으로 화면의 비선형 효과를 보완하기 위해 사용됩니다. 감마를 효과적으로 조절하여 검정과 흰색 사이의 변환 기울기를 변경합니다.";"CIGaussianBlur" = "가우시안 분포별로 지정된 양에 따라 소스 픽셀을 늘립니다.";"CIGaussianGradient" = "가우시안 분포를 사용하여 하나의 색상에서 다른 색상까지 다양한 그라디언트를 생성합니다.";"CIGlassDistortion" = "유리 모양의 텍스쳐를 적용하여 이미지를 왜곡합니다. 출력 이미지의 증가된 부분은 텍스쳐 맵을 적용한 결과입니다.";"CIGlassLozenge" = "마름모 모양의 렌즈를 생성하여 해당 렌즈가 있는 곳의 이미지 부분을 왜곡합니다.";"CIGlideReflectedTile" = "이미지를 변환하고 희미하게 하여 소스 이미지에서 타일된 이미지를 만듭니다.";"CIGloom" = "이미지의 하이라이트를 희미하게 합니다.";"CIHatchedScreen" = "하프톤 화면의 교차된 평행선 무늬 패턴을 시뮬레이션합니다.";"CIHeightFieldFromMask" = "흑백음영 마스크에서 연속 3차원, 로프트 모양의 높이 필드를 만듭니다. 마스크의 흰색 값은 검정 값이 높이 필드 밖에 있는 픽셀들을 정의하는 동안 높이 필드 안에 있는 픽셀들을 정의합니다. 마스크 가장자리 값이 0이 될 때까지 해당 필드가 마스크 안을 부드럽고 끊임없이 변경합니다. 이 필터와 그늘진 물체 필터를 함께 사용하여 실제와 너무나도 흡사한 음영이 있는 대상체를 만들 수 있습니다.";"CIHexagonalPixellate" = "대치한 픽셀의 평균 색상을 입힌 육각형으로 이미지를 나타냅니다.";"CIHoleDistortion" = "이미지를 밖으로 밀어내는 원 영역을 생성하여, 원과 가장 가까운 픽셀을 왜곡합니다.";"CIHueAdjust" = "소스 픽셀의 전체 색조 또는 명암을 변경합니다.";"CIKaleidoscope" = "12방향 대칭을 적용하여 소스 이미지에서 만화경같은 이미지를 만듭니다.";"CILanczosScaleTransform" = "고화질의 크기가 조절된 버전의 소스 이미지를 만듭니다. 이 필터는 일반적으로 이미지를 축소하는데 사용합니다.";"CILenticularHaloGenerator" = "렌즈의 퍼짐과 연관된 회절에 의해 생성된 주변광을 시뮬레이션합니다. 이 필터는 일반적으로 다른 이미지에 적용되어 렌즈 플레어 및 비슷한 효과를 시뮬레이션합니다.";"CILineOverlay" = "투명 이미지에서 윤곽을 그리지 않은 부분을 남겨두어 이미지 가장자리의 윤곽을 검정으로 그리는 스케치를 생성합니다. 결과는 알파를 가지고 있고 검정으로 렌더링되기 때문에, 소스 합성을 사용하여 다른 이미지 위로 렌더링할 때까지 잘 보이지 않습니다.";"CILineScreen" = "하프톤 화면의 선 패턴을 시뮬레이션합니다.";"CILinearGradient" = "정의된 두 끝점 사이의 선형 축을 따라 변화하는 그라디언트를 생성합니다.";"CIMaskToAlpha" = "흑백음영 이미지를 알파로 마스크된 흰색 이미지로 변환합니다. 소스 이미지의 흰색 값이 마스크 안쪽을 만들면 검정 값은 완전히 투명해집니다.";"CIMaximumCompositing" = "두 개의 입력 이미지의 최대값을 색상 구성요소로 계산한 다음 그 최대 값을 사용하여 출력 이미지를 생성합니다. 이것은 닷징과 비슷합니다.";"CIMedianFilter" = "인접한 픽셀 그룹에 대한 중간 값을 계산하여 각각의 픽셀 값을 중간 값으로 대치합니다. 이 효과는 노이즈를 줄입니다.";"CIMinimumCompositing" = "두 개의 입력 이미지의 최소값을 색상 구성요소로 계산한 다음 그 최소 값을 사용하여 출력 이미지를 생성합니다. 이것은 버닝과 비슷합니다.";"CIModTransition" = "불규칙한 모양의 홀을 통해 대상 이미지를 나타내어 하나의 이미지를 다른 이미지로 변환합니다.";"CIMotionBlur" = "이미지에 흐림 효과를 주어서 이미지를 캡처하는 동안 지정된 각도 및 거리를 이동하는 카메라를 사용하여 효과를 시뮬레이션합니다.";"CIMultiplyCompositing" = "두 개의 입력 이미지의 색상 구성요소를 곱하고 곱한 값을 사용하여 출력 이미지를 생성합니다. 이 필터는 일반적으로 영역광 또는 비슷한 조명 효과를 이미지에 추가하는데 사용됩니다.";"CINoiseReduction" = "노이즈로 간주되는 것을 정의하기 위해 경계 값을 사용하여 노이즈를 줄입니다. 아래 휘도에 있는 작은 변경사항은 해당 값이 노이즈로 간주되어 로컬 흐림 효과라는 노이즈 감소 처리를 받습니다. 위의 경계 값 변경사항은 가장자리로 간주되기 때문에 선명해집니다.";"CIOpTile" = "지정된 모든 크기 조절 및 회전을 사용하여 이미지를 분리한 다음, 이미지를 다시 결합하여 옵 아트 모양을 제공합니다.";"CIPageCurlTransition" = "페이지 말림으로 새로운 이미지를 드러내는 말리는 페이지를 시뮬레이션하여 하나의 이미지를 다른 이미지로 변환합니다.";"CIParallelogramTile" = "평행 사변형으로 반사하여 이미지를 감싼 다음, 결과를 타일링합니다.";"CIPerspectiveTile" = "원근법 변형을 이미지에 적용한 다음 결과를 타일링합니다.";"CIPerspectiveTransform" = "이미지 배열을 대치하여 보는 위치를 변경하는 옵저버를 시뮬레이션합니다. 원근법 필터를 사용하여 이미지를 구부릴 수 있습니다.";"CIPinchDistortion" = "소스 픽셀을 안으로 핀치하는 사각형 모양을 생성하여, 사각형과 가장 가까운 픽셀을 왜곡합니다.";"CIPixellate" = "뭉툭한 이미지를 만듭니다.";"CIPointillize" = "아주 세세한 스타일로 이미지를 렌더링합니다.";"CIRadialGradient" = "중심이 같은 두 원 사이를 반지름 방향으로 변경하는 그라디언트를 생성합니다. 반경이 0인 두 원 중 한 원에 유효합니다.";"CIRandomGenerator" = "픽셀 값이 독립된, 0과 1사이에서 균일하게 분배된 네 개의 무작위 숫자로 구성된 무한한 범위의 이미지를 생성합니다.";"CIRippleTransition" = "파장이 있은 후 새로운 이미지를 드러내며 중심으로부터 확장되는 원형 파장을 생성하여 하나의 이미지를 다른 이미지로 변환합니다.";"CISepiaTone" = "이미지 색상을 다양한 갈색 음영으로 매핑합니다.";"CIShadedMaterial" = "높이 필드에서 음영이 있는 이미지를 만듭니다. 높이 필드는 밝은 음영이 있는 높은 높이와 어두운 음영이 있는 낮은 높이(하위 영역)를 가진 것으로 정의됩니다. 이 필터를 마스크에서 높이 필드 필터와 결합하여 텍스트와 같은 음영 마스크를 빨리 만들 수 있습니다.";"CISharpenLuminance" = "선명하게 하여 이미지 디테일을 향상시킵니다. 이미지의 휘도에 적용하여 픽셀의 채도에는 영향을 주지 않습니다.";"CISixfoldReflectedTile" = "6방향 반사 대칭을 적용하여 소스 이미지에서 타일된 이미지를 만듭니다.";"CISixfoldRotatedTile" = "60도 각도로 소스를 회전하여 소스 이미지에서 타일된 이미지를 만듭니다.";"CISourceAtopCompositing" = "소스 이미지를 배경 이미지 위에 놓고, 배경 이미지의 채도를 사용하여 어떻게 보여줄지를 결정합니다. 합성물은 배경 이미지와 보이는 배경 부분 위에 있는 소스 이미지만 보여줍니다.";"CISourceInCompositing" = "두번째 이미지를 사용하여 이미지를 효과적으로 자르고, 소스 이미지에 무엇을 남겨둘지를 정의합니다.";"CISourceOutCompositing" = "두번째 이미지를 사용하여 첫번째 이미지로 무엇을 가져갈 것인지를 정의합니다.";"CISourceOverCompositing" = "두번째 이미지를 첫번째 이미지 위에 둡니다.";"CISpotColor" = "하나 이상의 색상 범위를 영역 색상으로 대치합니다.";"CISpotLight" = "방향이 있는 영역광 효과를 이미지에 적용합니다.";"CIStarShineGenerator" = "스타버스트 패턴을 생성합니다. 결과 이미지는 일반적으로 다른 필터의 입력 값으로 사용됩니다.";"CIStripesGenerator" = "스트라이프 패턴을 생성합니다. 스트라이프, 공간 및 대비의 색상을 제어할 수 있습니다.";"CISunbeamsGenerator" = "태양 효과를 생성합니다. 일반적으로 합성 필터의 입력 값으로 태양광 필터의 결과 값을 사용합니다.";"CISwipeTransition" = "강타 동작을 시뮬레이션하여 하나의 이미지를 다른 이미지로 변환합니다.";"CITorusLensDistortion" = "토러스 모양의 렌즈를 생성하여 해당 렌즈가 있는 곳의 이미지 부분을 왜곡합니다.";"CITriangleTile" = "이미지의 삼각형 부분을 삼각형 영역으로 매핑한 다음 결과를 타일링합니다.";"CITwelvefoldReflectedTile" = "12방향 반사 대칭을 적용하여 소스 이미지에서 타일된 이미지를 만듭니다.";"CITwirlDistortion" = "포인트 주변의 픽셀을 회전하여 나선형 효과를 제공합니다. 회전 수뿐만 아니라 효과의 중심 및 반경도 지정할 수 있습니다.";"CIUnsharpMask" = "이미지에 있는 다른 색상 픽셀 사이의 가장자리 대비를 증가시킵니다.";"CIVortexDistortion" = "포인트 주변의 픽셀을 회전하여 소용돌이 효과를 시뮬레이션합니다. 회전 수뿐만 아니라 효과의 중심 및 반경도 지정할 수 있습니다. ";"CIWhitePointAdjust" = "이미지에 대한 하얀 점 참조를 조절하고 새로운 참조를 사용하여 소스에 있는 모든 색상을 매핑합니다.";"CIZoomBlur" = "이미지를 캡처하는 동안 카메라의 주밍 효과를 시뮬레이션합니다.";"CIColorBlendMode" = "소스 이미지의 색조 및 채도 값과 함께 휘도 값을 배경에 사용합니다. 이 모드는 이미지의 회색 레벨을 보존합니다.";"CIColorBurnBlendMode" = "소스 이미지 샘플을 반사하여 배경 이미지를 어둡게 합니다. 횐색을 지정하는 소스 이미지 샘플 값은 변경되지 않습니다.";"CIColorDodgeBlendMode" = "소스 이미지 샘플을 반사하여 배경 이미지를 밝게 합니다. 검정색을 지정하는 소스 이미지 샘플 값은 변경되지 않습니다.";"CIDarkenBlendMode" = "소스 이미지 또는 배경으로부터 어두운 샘플을 선택하여 합성 이미지 샘플을 생성합니다. 배경 이미지 샘플이 모든 어두운 소스 이미지 샘플을 대치했습니다. 반면에, 배경 이미지 샘플은 변경되지 않습니다.";"CIDifferenceBlendMode" = "배경 이미지 샘플 색상 또는 반대로, 더 밝은 값을 가진 샘플에 기반하여 소스 이미지 샘플 색상을 뺍니다. 소스 이미지 샘플 값은 검정은 변경하지 않고, 흰색은 배경 색상 값으로 반전합니다.";"CIExclusionBlendMode" = "차이 혼합 모드(CIDifferenceBlendMode) 필터로 생성된 결과와 비슷하지만 낮은 대비를 가집니다. 소스 이미지 샘플 값이 검정은 변경하지 않고, 흰색은 배경 색상 값으로 반전합니다.";"CIHardLightBlendMode" = "소스 이미지 샘플 색상에 따라 증대 효과를 적용하거나  화면 색상을 사용합니다. 소스 이미지 샘플 색상이 50% 회색보다 밝으면, 스크리닝과 유사하게 배경이 밝아집니다. 소스 이미지 샘플 색상이 50% 회색보다 어두우면, 증대 효과와 유사하게 배경이 어두워집니다. 소스 이미지 샘플 색상이 50% 회색과 동일하면, 소스 이미지는 변견되지 않습니다. 순수 검정 또는 순수 흰색과 동일한 이미지 샘플은 순수 검정 또는 흰색을 만들어 냅니다. 전체 효과는 소스 이미지에서 하쉬 영역광을 반짝반짝 빛나게하여 사용자가 만들었던 것과 비슷합니다.";"CIHueBlendMode" = "소스 이미지의 색조와 함께 배경의 휘도 및 채도 값을 사용합니다.";"CILightenBlendMode" = "이미지 또는 배경에서 밝은 샘플을 선택하여 합성 이미지 샘플을 생성합니다. 배경 이미지 샘플이 모든 밝은 소스 이미지 샘플을 대치했습니다. 반면에, 배경 이미지 샘플은 변경되지 않습니다.";"CILuminosityBlendMode" = "소스 이미지의 휘도와 함께 배경의 색조 및 채도를 사용합니다. 이 모드는 일반 효과를 색상 혼합 모드 필터로 생성된 효과로 반전시키는 효과를 생성합니다.";"CIMultiplyBlendMode" = "소스 이미지 샘플과 배경 이미지 샘플을 곱합니다. 이것은 최소한 두 가지의 제공 샘플 색상 모두만큼이나 어두운 색상을 만들어냅니다.";"CIOverlayBlendMode" = "배경 색상에 따라 소스 이미지 샘플과 배경 이미지 샘플을 곱하거나 스크린합니다. 배경 하이라이트 및 그림자를 보존하는 동안에 기존의 이미지 샘플을 오버레이합니다. 배경이 색상과 소스 이미지를 혼합하여 배경의 밝기 또는 어둠을 반사합니다.";"CISaturationBlendMode" = "배경의 휘도 및 색조 값과 함께 소스 이미지의 채도를 사용합니다. 채도가 없는(순수 회색 영역) 배경 영역은 변경되지 않습니다.";"CIScreenBlendMode" = "소스 이미지 샘플의 반전과 배경 이미지 샘플의 반전을 곱합니다. 이것은 최소한 두 가지의 제공 샘플 색상 모두만큼이나 어두운 색상을 만들어냅니다.";"CISoftLightBlendMode" = "소스 이미지 샘플 색상에 따라 어두운 또는 밝은 색상을 사용합니다. 소스 이미지 샘플 색상이 50% 회색보다 밝으면, 닷징과 유사하게 배경이 밝아집니다. 소스 이미지 샘플 색상이 50% 회색보다 어두우면, 버닝과 유사하게 배경이 어두워집니다. 소스 이미지 샘플 색상이 50% 회색과 동일하면, 배경은 변경되지 않습니다. 순수 검정 또는 순수 흰색과 동일한 이미지 샘플은 어둡거나 밝은 영역은 만들지만, 순수 검정 또는 흰색을 만들지는 않습니다. 전체 효과는 소스 이미지에 있는 확산 영역광을 반짝반짝 빛나게하여 사용자가 만들었던 것과 비슷합니다.";"outputImage" = "필터로 만든 이미지.";"inputBackgroundImage" = "배경 이미지로 사용할 이미지.";"inputImage" = "입력 이미지로 사용할 이미지. 배경 이미지로도 사용할 수 있는 필터에 대해, 이것은 전경 이미지입니다.";"inputTime" = "효과의 실행 시간.";"inputTransform" = "적용할 변형.";"inputScale" = "효과의 정도.";"inputAspectRatio" = "영상비.";"inputCenter" = "필터링할 x 및 y 좌표로된 영역의 중심.";"inputRadius" = "효과 중심으로부터의 거리.";"inputAngle" = "각도.";"inputRefraction" = "효과에서 사용되는 물체의 굴절(유리와 같은) 인덱스.";"inputWidth" = "효과의 너비.";"inputSharpness" = "적용할 선명도 정도.";"inputIntensity" = "효과의 강도.";"inputEV" = "이미지를 밝게 또는 어둡게 만드는 F-스톱의 수.";"inputSaturation" = "채도 조절 정도.";"inputColor" = "색상.";"inputBrightness" = "밝기 레벨.";"inputContrast" = "대비 레벨.";"inputGradientImage" = "알파로 매핑할 환경. 일반적으로, 이것은 하이라이트 및 그림자를 포함하는 이미지입니다.";"inputMaskImage" = "마스킹 이미지.";"inputShadingImage" = "알파 값으로 매핑할 환경. 일반적으로, 이것은 하이라이트 및 그림자를 포함하는 이미지입니다.";"inputTargetImage" = "변환 대상 이미지.";"inputExtent" = "효과의 면적을 정의하는 사각형.";"CIBoxBlur.inputRadius" = "흐림 효과를 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 결과도 흐려집니다.";"CIDiscBlur.inputRadius" = "흐림 효과를 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 결과도 흐려집니다.";"CIGaussianBlur.inputRadius" = "흐림 효과를 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 결과도 흐려집니다.";"CIMotionBlur.inputRadius" ="흐림 효과를 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 결과도 흐려집니다.";"CIMotionBlur.inputAngle" = "모션 각도는 어떤 방향으로 흐림 효과를 나타낼지를 결정합니다.";"CINoiseReduction.inputNoiseLevel" = "노이즈 감소 정도. 값이 커질수록 더 많은 노이즈를 줄입니다.";"CINoiseReduction.inputSharpness" = "최종 이미지의 선명도. 해당 값이 커질수록, 결과도 선명해집니다.";"CIZoomBlur.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치.";"CIZoomBlur.inputAmount" = "확대(zoom-in) 정도. 값이 커질수록 더 많이 확대됩니다.";"CIColorControls.inputSaturation" = "적용할 채도 정도. 해당 값이 커질수록, 결과에 더 높은 채도가 적용됩니다.";"CIColorControls.inputBrightness" = "적용할 밝기 정도. 해당 값이 커질수록, 결과도 밝아집니다.";"CIColorControls.inputContrast" = "적용할 대비 정도. 해당 값이 커질수록, 결과 이미지에 더 높은 대비를 적용합니다.";"CIColorMatrix.inputRVector" = "소스 색상 값에 곱할 빨간색 값.";"CIColorMatrix.inputGVector" = "소스 색상 값에 곱할 녹색 값.";"CIColorMatrix.inputBVector" = "소스 색상 값에 곱할 파란색 값.";"CIColorMatrix.inputAVector" = "소스 색상 값에 곱할 알파 값.";"CIColorMatrix.inputBiasVector" = "각각의 색상 구성요소에 추가된 벡터.";"CIExposureAdjust.inputEV" = "이미지 노출 조절 정도. 해당 값이 커질수록, 노출이 밝아집니다.";"CIGammaAdjust.inputPower" = "이미지 밝기를 보정하는데 사용할 감마 값. 해당 값이 커질수록 결과는 어두워집니다.";"CIHueAdjust.inputAngle" = "이미지 색조를 보정하는데 사용할 각(각도).";"CIWhitePointAdjust.inputColor" = "하얀 점으로 사용할 색상.";"CIColorCube.inputDimension" = "색상표의 규격.";"CIColorCube.inputCubeData" = "이것은 미리 증대된 알파를 사용하는 부동 소수점 RGBA 셀의 색상표입니다. 이 셀들은 표준 순서로 구성되었습니다. 데이터의 열과 행은 각각 빨강과 녹색으로 인덱스되었습니다. 각각의 데이터 플레인은 파랑으로 인덱스된 플레인과 함께 데이터에서 다음으로 높은 플레인을 따릅니다.";"CIColorMap.inputGradientImage" = "이 이미지의 이미지 데이터는 소스 이미지 값을 변형합니다.";"CIColorMonochrome.inputColor" = "이미지에 적용할 단색 색상입니다.";"CIColorMonochrome.inputIntensity" = "단색 효과의 강도. 1.0의 값은 제공된 색상을 사용하여 단색 이미지를 생성합니다. 0.0의 값은 이미지에 효과를 적용하지 않습니다.";"CIColorPosterize.inputLevels" = "각각의 색상 구성요소에 사용할 밝기 레벨의 숫자. 값이 낮으면 더 강력한 포스터 효과가 발생합니다.";"CIFalseColor.inputColor0" = "색상 램프에 사용할 첫번째 색상.";"CIFalseColor.inputColor1" = "색상 램프에 사용할 두번째 색상.";"CISepiaTone.inputIntensity" = "세피아 효과의 강도. 1.0의 값은 단색 세피아 이미지를 생성합니다. 0.0의 값은 이미지에 효과를 나타내지 않습니다.";"CIBumpDistortion.inputCenter" = "범프의 중심으로 사용할 x 및 y 위치."; "CIBumpDistortion.inputRadius" = "왜곡을 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 왜곡의 면적도 넓어집니다."; "CIBumpDistortion.inputScale" = "효과의 크기는 범프의 굴곡이 결정합니다. 0.0의 값은 효과가 없습니다. 양수는 확장 범프를 생성하고, 음수는 축소 범프를 생성합니다."; "CIBumpDistortionLinear.inputCenter" = "왜곡의 중심으로 사용할 x 및 y 위치."; "CIBumpDistortionLinear.inputRadius" = "왜곡을 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 왜곡의 면적도 넓어집니다.";  "CIBumpDistortionLinear.inputScale" = "효과의 크기."; "CIBumpDistortionLinear.inputAngle" = "왜곡이 발생하는 위치 주변 선의 각(각도)."; "CICircleSplashDistortion.inputCenter" = "왜곡의 중심으로 사용할 x 및 y 위치.";  "CICircleSplashDistortion.inputRadius" = "왜곡을 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 왜곡의 면적도 넓어집니다.";  "CICircularWrap.inputCenter" = "왜곡의 중심으로 사용할 x 및 y 위치.";  "CICircularWrap.inputRadius" = "왜곡을 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 왜곡의 면적도 넓어집니다.";  "CICircularWrap.inputAngle" = "효과의 각도."; "CIDisplacementDistortion.inputDisplacementImage" = "흑백음영 값을 소스 이미지에 적용한 이미지."; "CIDisplacementDistortion.inputScale" = "결과 이미지의 텍스쳐링 정도. 해당 값이 커질수록, 텍스쳐가 켜집니다."; "CIGlassDistortion.inputTexture" = "소스 이미지에 적용할 텍스쳐.";"CIGlassDistortion.inputCenter" = "왜곡의 중심으로 사용할 x 및 y 위치."; "CIGlassDistortion.inputScale" = "결과 이미지의 텍스쳐링 정도. 해당 값이 커질수록, 텍스쳐가 켜집니다."; "CIGlassLozenge.inputPoint0" = "어떤 마름모 끝에서 원의 중심을 정의하는 x 및 y 위치."; "CIGlassLozenge.inputPoint1" = "다른 마름모 끝에서 원의 중심을 정의하는 x 및 y 위치.";  "CIGlassLozenge.inputRadius" = "마름모의 반경. 반경이 클수록, 왜곡의 면적이 넓어집니다.";  "CIGlassLozenge.inputRefraction" = "유리의 굴절."; "CIHoleDistortion.inputCenter" = "왜곡의 중심으로 사용할 x 및 y 위치.";  "CIHoleDistortion.inputRadius" = "왜곡을 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 왜곡의 면적도 넓어집니다.";  "CIPinchDistortion.inputCenter" = "왜곡의 중심으로 사용할 x 및 y 위치."; "CIPinchDistortion.inputRadius" = "왜곡을 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 왜곡의 면적도 넓어집니다."; "CIPinchDistortion.inputScale" = "핀칭 정도. 0.0의 값은 효과가 없습니다. 1.0의 값은 최대 핀치입니다.";"CITorusLensDistortion.inputCenter" = "토러스의 중심으로 사용할 x 및 y 위치.";  "CITorusLensDistortion.inputRadius" = "토러스 외부 반경.";  "CITorusLensDistortion.inputWidth" = "링의 너비."; "CITorusLensDistortion.inputRefraction" = "유리의 굴절."; "CITwirlDistortion.inputCenter" = "왜곡의 중심으로 사용할 x 및 y 위치.";  "CITwirlDistortion.inputRadius" = "왜곡을 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 왜곡의 면적도 넓어집니다."; "CITwirlDistortion.inputAngle" = "나선형의 각(각도). 값은 양수 또는 음수일 수 있습니다.";"CIVortexDistortion.inputCenter" = "왜곡의 중심으로 사용할 x 및 y 위치."; "CIVortexDistortion.inputRadius" = "왜곡을 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 왜곡의 면적도 넓어집니다."; "CIVortexDistortion.inputAngle" = "소용돌이의 각(각도).";"CICheckerboardGenerator.inputColor0" = "첫번째 체커보드 정사각형 세트에 사용할 색상.";"CICheckerboardGenerator.inputColor1" = "두번째 체커보드 정사각형 세트에 사용할 색상.";"CICheckerboardGenerator.inputWidth" = "체커보드 패턴에서의 정사각형 너비.";"CICheckerboardGenerator.inputSharpness" = "체커보드 패턴의 선명도. 해당 값이 작아지면, 패턴이 더욱 흐려집니다. 값은 0.0에서 1.0까지 다양합니다.";"CIConstantColorGenerator.inputColor" = "생성할 색상."; "CILenticularHaloGenerator.inputCenter" = "주변광 효과의 중심으로 사용할 x 및 y 위치.";"CILenticularHaloGenerator.inputHaloRadius" = "주변광 반경.";"CILenticularHaloGenerator.inputHaloWidth" = "안쪽 반경에서 바깥쪽 반경까지의 주변광 너비.";"CILenticularHaloGenerator.inputOverlap" = "주변광 회절 구성요소의 오버랩 정도. 1.0의 값은 완전한 오버랩이고 주변광은 흰색입니다. 0.0의 값은 오버랩이 없고 주변광 색상을 오버랩하지 않습니다.";"CILenticularHaloGenerator.inputStriationStrength" = "주변광 색상의 강도. 값이 커질수록 강도가 세집니다.";"CILenticularHaloGenerator.inputStriationContrast" = "주변광 색상의 대비. 값이 커질수록 대비가 높아집니다.";"CIStarShineGenerator.inputCenter" = "별의 중심으로 사용할 x 및 y 위치."; "CIStarShineGenerator.inputColor" = "원형 별의 외부 셀에 사용할 색상."; "CIStarShineGenerator.inputRadius" = "별의 반경."; "CIStarShineGenerator.inputCrossScale" = "크로스 패턴의 크기."; "CIStarShineGenerator.inputCrossAngle" = "크로스 패턴의 각도."; "CIStarShineGenerator.inputCrossOpacity" = "크로스 패턴의 불투명도."; "CIStarShineGenerator.inputCrossWidth" = "크로스 패턴의 너비."; "CIStarShineGenerator.inputEpsilon" = "크로스 스파이크의 길이."; "CIStripesGenerator.inputCenter" = "스트라이프 패턴의 중심으로 사용할 x 및 y 위치."; "CIStripesGenerator.inputColor0" = "홀수 스트라이프에 사용할 색상."; "CIStripesGenerator.inputColor1" = "짝수 스트라이프에 사용할 색상.";"CIStripesGenerator.inputWidth" = "스트라이프의 너비."; "CIStripesGenerator.inputSharpness" = "스트라이프 패턴의 선명도. 해당 값이 작아지면, 패턴이 더욱 흐려집니다. 값은 0.0에서 1.0까지 다양합니다."; "CISunbeamsGenerator.inputCenter" = "태양광 패턴의 중심으로 사용할 x 및 y 위치";"CISunbeamsGenerator.inputColor" = "태양의 색상.";"CISunbeamsGenerator.inputSunRadius" = "태양의 반경.";"CISunbeamsGenerator.inputMaxStriationRadius" = "태양광의 반경.";"CISunbeamsGenerator.inputStriationStrength" = "태양광의 강도. 값이 커질수록 강도는 더 세집니다.";"CISunbeamsGenerator.inputStriationContrast" = "태양광의 대비. 값이 커질수록 더 높은 대비를 적용합니다.";"CIAffineTransform.inputTransform" = "이미지에 적용할 변형입니다."; "CICrop.inputRectangle" = "이미지에 적용할 자르기를 지정하는 사각형."; "CILanczosScaleTransform.inputScale" = "이미지에 사용할 크기 조절 인수. 값이 1.0보다 작으면 이미지를 축소합니다. 값이 1.0보다 크면 이미지를 확대합니다."; "CILanczosScaleTransform.inputAspectRatio" = "이미지 영상비."; "CIPerspectiveTransform.inputTopLeft" = "이미지를 매핑하는 상단 왼쪽 좌표."; "CIPerspectiveTransform.inputTopRight" = "이미지를 매핑하는 상단 오른쪽 좌표."; "CIPerspectiveTransform.inputBottomRight" = "이미지를 매핑하는 하단 오른쪽 좌표."; "CIPerspectiveTransform.inputBottomLeft" = "이미지를 매핑하는 하단 왼쪽 좌표."; "CIGaussianGradient.inputColor0" = "그라디언트에서 사용할 첫번째 색상"; "CIGaussianGradient.inputColor1" = "그라디언트에서 사용할 두번째 색상"; "CIGaussianGradient.inputRadius" = "가우시안 분포의 반경."; "CILinearGradient.inputPoint0" = "첫번째 색상이 시작되는 그라디언트의 시작 지점."; "CILinearGradient.inputPoint1" = "세단 색상이 시작되는 그라디언트 종료 지점."; "CILinearGradient.inputColor0" = "그라디언트에서 사용할 첫번째 색상";  "CILinearGradient.inputColor1" = "그라디언트에서 사용할 두번째 색상";  "CIRadialGradient.inputRadius0" = "그라디언트에서 사용할 시작 원의 반경.";"CIRadialGradient.inputRadius1" = "그라디언트에서 사용할 끝 원의 반경.";"CIRadialGradient.inputColor0" = "그라디언트에서 사용할 첫번째 색상";  "CIRadialGradient.inputColor1" = "그라디언트에서 사용할 두번째 색상"; "CICircularScreen.inputCenter" = "원형의 화면 패턴의 중심으로 사용할 x 및 y 위치."; "CICircularScreen.inputWidth" = "패턴에 있는 각각의 원 사이의 거리."; "CICircularScreen.inputSharpness" = "원의 선명도. 해당 값이 커질수록, 원도 선명해집니다."; "CICMYKHalftone.inputCenter" = "하프톤 패턴의 중심으로 사용할 x 및 y 위치.";  "CICMYKHalftone.inputWidth" = "패턴에 있는 점 사이의 거리."; "CICMYKHalftone.inputAngle" = "패턴의 각도."; "CICMYKHalftone.inputSharpness" = "패턴의 선명도. 해당 값이 커질수록, 패턴도 선명해집니다."; "CICMYKHalftone.inputGCR" = "회색 구성요소 대치 값. 해당 값은 0.0(없음)에서 1.0까지 다양할 수 있습니다."; "CICMYKHalftone.inputUCR" = "하단 색상 제거 값. 해당 값은 0.0에서 1.0까지 다양할 수 있습니다. "; "CIDotScreen.inputCenter" = "도트 화면 패턴의 중심으로 사용할 x 및 y 위치.";  "CIDotScreen.inputAngle" = "패턴의 각도."; "CIDotScreen.inputWidth" = "패턴에 있는 점 사이의 거리."; "CIDotScreen.inputSharpness" = "패턴의 선명도. 해당 값이 커질수록, 패턴도 선명해집니다."; "CIHatchedScreen.inputCenter" = "교차된 평행선 무늬 화면 패턴 중심으로 사용할 x 및 y 위치."; "CIHatchedScreen.inputAngle" = "패턴의 각도.";"CIHatchedScreen.inputWidth" = "패턴에 있는 선 사이의 거리."; "CIHatchedScreen.inputShaprness" = "패턴의 선명도. 해당 값이 커질수록, 패턴도 선명해집니다."; "CILineScreen.inputCenter" = "라인 화면 패턴 중심으로 사용할 x 및 y 위치.";  "CILineScreen.inputAngle" = "패턴의 각도."; "CILineScreen.inputWidth" = "패턴에 있는 선 사이의 거리."; "CILineScreen.inputSharpness" = "패턴의 선명도. 해당 값이 커질수록, 패턴도 선명해집니다."; 	"CISharpenLuminance.inputSharpness" = "적용할 선명도의 정도. 값이 커질수록 선명해집니다.";"CIUnsharpMask.inputRadius" = "선명하지 않은 마스크에 적용할 제공된 픽셀 주변의 반경. 반경이 커질수록, 더 많은 이미지가 영향을 받습니다.";"CIUnsharpMask.inputIntensity" = "효과의 강도. 값이 커질수록, 영향을 받은 영역에서 더 높은 대비를 적용합니다.";"CIBlendWithMask.inputMaskImage" = "흑백음영 마스크. 마스크 값이 0.0이면, 그 값은 배경입니다. 마스크 값이 1.0이면, 그 값은 이미지입니다."; "CIBloom.inputRadius" = "효과를 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 효과도 커집니다.";"CIBloom.inputIntensity" = "효과 강도. 0.0의 값은 효과가 없습니다. 1.0의 값은 최대 효과입니다."; "CICrystallize.inputRadius" = "효과를 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 결과 크리스탈도 커집니다."; "CIEdges.inputIntensity" = "가장자리의 강도. 해당 값이 커질수록, 강도가 세집니다."; "CIEdgeWork.inputRadius" = "가장자리의 두께. 해당 값이 커질수록, 가장자리가 얇아집니다."; "CIGloom.inputRadius" = "효과를 생성하는데 얼마나 많은 픽셀이 사용되는지는 반경이 결정합니다. 반경이 커질수록, 효과도 커집니다."; "CIGloom.inputIntensity" = "효과 강도. 0.0의 값은 효과가 없습니다. 1.0의 값은 최대 효과입니다."; "CIHeightFieldFromMask.inputImage" = "마스크의 흰색 값은 검정 값이 높이 필드 밖에 있는 픽셀들을 정의하는 동안 높이 필드 안에 있는 픽셀들을 정의합니다. 마스크 가장자리 값이 0이 될 때까지 해당 필드가 마스크 안을 부드럽고 끊임없이 변경합니다."; "CIHeightFieldFromMask.inputRadius" = "부드러운 변환을 위해 마스크 가장자리까지의 거리는 입력 반경에 비례합니다. 값이 크면 더 부드럽고 선명하게 변환됩니다. 값이 작으면 필렛 반경과 가깝게 변환합니다."; "CIHexagonalPixellate.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치."; "CIHexagonalPixellate.inputScale" = "크기는 육각형의 사이즈가 결정합니다. 값이 클수록 육각형도 커집니다."; "CILineOverlay.inputNRNoiseLevel" = "이미지 가장자리를 추적하기 전에 제거되는 이미지(카메라 데이터와 사용되는)의 노이즈 레벨. 노이즈 레벨이 증가하면 추적한 이미지 가장자리를 깨끗하게 해줍니다."; "CILineOverlay.inputNRSharpness" = "이미지 가장자리를 추적하기 전에 이미지에서 노이즈를 제거할 때 선명화 완료 정도. 이것은 가장자리 포착을 향상시킵니다."; "CILineOverlay.inputEdgeIntensity" = "이미지 가장자리를 추적할 때 Sobel 그라디언트 정보의 악센트 인수. 일반적으로 낮은 값(1.0)이 사용되지만, 값이 커질수록 더 많은 가장자리를 찾습니다."; "CILineOverlay.inputThreshold" = "이 값은 가장자리 가시성을 결정합니다. 값이 커질수록 가장자리 바깥이 얇아집니다."; "CILineOverlay.inputContrast" = "이 필터가 만든 가장자리에 사용할 안티 앨리어싱(Anti-aliasing)의 정도. 값이 커질수록 대비가 높은 가장자리를 만듭니다(더 작게 안티 앨리어싱됩니다)."; "CIPixellate.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치.";  "CIPixellate.inputScale" = "크기는 정사각형의 사이즈가 결정합니다. 값이 클수록 정사각형도 커집니다."; "CIPointillize.inputRadius" = "결과 패턴에서 원의 반경."; "CIPointillize.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치.";  "CIShadedMaterial.inputShadingImage" = "높이 필드에 사용할 이미지. 결과 이미지는 밝은 음영이 있는 높은 높이와 어두운 음영이 있는 낮은 높이(하위 영역)를 가지고 있습니다."; "CIShadedMaterial.inputScale" = "효과의 크기. 해당 값이 높아질수록, 더 극적인 효과가 발생합니다."; "CISpotColor.inputCenterColor1" = "대치할 첫번째 색상 범위의 중앙 값."; "CISpotColor.inputReplacementColor1" = "첫번째 색상 범위에 대한 대치 색상."; "CISpotColor.inputCloseness1" = "대치되기 전에 첫번째 색상과 얼마나 가깝게 일치시킬지를 표시하는 값."; "CISpotColor.inputContrast1" = "첫번째 대치 색상의 대비."; "CISpotColor.inputCenterColor2" = "대치할 두번째 색상 범위의 중앙 값."; "CISpotColor.inputReplacementColor2" = "두번째 색상 범위에 대한 대치 색상.";"CISpotColor.inputCloseness2" = "대치되기 전에 두번째 색상과 얼마나 가깝게 일치시킬지를 표시하는 값."; "CISpotColor.inputContrast2" = "두번째 대치 색상의 대비."; "CISpotColor.inputCenterColor3" = "대치할 세번째 색상 범위의 중앙 값.";  "CISpotColor.inputReplacementColor3" = "세번째 색상 범위에 대한 대치 색상."; "CISpotColor.inputCloseness3" = "대치되기 전에 세번째 색상과 얼마나 가깝게 일치시킬지를 표시하는 값";  "CISpotColor.inputContrast3" = "세번째 대치 색상의 대비.";  "CISpotLight.inputLightPosition" = "영역광의 x 및 y 위치."; 		"CISpotLight.inputLightPointsAt" = "영역광 포인트가 있는 x 및 y 위치.";  "CISpotLight.inputBrightness" = "영역광의 밝기."; "CISpotLight.inputConcentration" = "영역광의 크기. 값이 작을수록 광선에 더 집중적으로 초점이 맞춰집니다."; "CISpotLight.inputColor" = "영역광의 색상."; "CIAffineClamp.inputTransform" = "이미지에 적용할 변형입니다."; "CIAffineTile.inputTransform" = "이미지에 적용할 변형입니다."; "CIEightfoldReflectedTile.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치.";  "CIEightfoldReflectedTile.inputAngle" = "타일된 패턴의 각(각도)."; "CIEightfoldReflectedTile.inputWidth" = "타일의 너비."; "CIFourfoldReflectedTile.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치.";  "CIFourfoldReflectedTile.inputAngle" = "타일된 패턴의 각(각도).";  "CIFourfoldReflectedTile.inputAcuteAngle" = "반복되는 반사 타일에 대한 주 각도. 작은 값은 얇은 다이아몬드 타일을 생성하고 큰 값은 대형 반사 타일을 생성합니다."; "CIFourfoldReflectedTile.inputWidth" = "타일의 너비.";  "CIFourfoldRotatedTile.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치.";  "CIFourfoldRotatedTile.inputAngle" = "타일된 패턴의 각(각도).";  "CIFourfoldRotatedTile.inputWidth" = "타일의 너비."; "CIFourfoldTranslatedTile.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치.";  "CIFourfoldTranslatedTile.inputAngle" = "타일된 패턴의 각(각도).";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "반복되는 변환 타일에 대한 주 각도. 작은 값은 얇은 다이아몬드 타일을 생성하고 큰 값은 대형 변환 타일을 생성합니다."; "CIFourfoldTranslatedTile.inputWidth" = "타일의 너비.";  "CIGlideReflectedTile.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치.";  "CIGlideReflectedTile.inputAngle" = "타일된 패턴의 각(각도).";  "CIGlideReflectedTile.inputWidth" = "타일의 너비.";  "CIKaleidoscope.inputCount" = "패턴에서 반사의 수."; "CIKaleidoscope.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치.";  "CIKaleidoscope.inputAngle" = "반사각."; "CIOpTile.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치.";  "CIOpTile.inputScale" = "크기는 효과에 있는 타일 수가 결정합니다."; "CIOpTile.inputAngle" = "타일의 각도."; "CIOpTile.inputWidth" = "타일의 너비."; "CIParallelogramTile.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치."; "CIParallelogramTile.inputAngle" = "타일된 패턴의 각(각도).";  "CIParallelogramTile.inputAcuteAngle" = "반복되는 평행 사변형 타일에 대한 주 각도. 작은 값은 얇은 다이아몬드 타일을 생성하고 큰 값은 대형 평행 사변형 타일을 생성합니다."; "CIParallelogramTile.inputWidth" = "타일의 너비.";  "CIPerspectiveTile.inputTopLeft" = "타일의 상단 왼쪽 좌표."; "CIPerspectiveTile.inputTopRight" = "타일의 상단 오른쪽 좌표.";"CIPerspectiveTile.inputBottomRight" = "타일의 하단 오른쪽 좌표."; "CIPerspectiveTile.inputBottomLeft" = "타일의 하단 왼쪽 좌표."; "CISixfoldReflectedTile.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치.";  "CISixfoldReflectedTile.inputAngle" = "타일된 패턴의 각(각도).";  "CISixfoldReflectedTile.inputWidth" = "타일의 너비."; "CISixfoldRotatedTile.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치."; "CISixfoldRotatedTile.inputAngle" = "타일된 패턴의 각(각도).";  "CISixfoldRotatedTile.inputWidth" = "타일의 너비.";  "CITriangleTile.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치.";  "CITriangleTile.inputAngle" = "타일된 패턴의 각(각도).";  "CITriangleTile.inputWidth" = "타일의 너비.";  "CITwelvefoldReflectedTile.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치."; "CITwelvefoldReflectedTile.inputAngle" = "타일된 패턴의 각(각도).";"CITwelvefoldReflectedTile.inputWidth" = "타일의 너비."; "CIBarsSwipeTransition.inputAngle" = "막대의 각(각도).";	"CIBarsSwipeTransition.inputWidth" = "각 막대의 너비.";	"CIBarsSwipeTransition.inputBarOffset" = "다른 막대에 대한 막대 하나의 오프셋";	"CIBarsSwipeTransition.inputTime" = "변환의 매개변수 시간. 이 값은 시작(시간 0)에서 종료(시간 1)까지를 변환합니다.";"CICopyMachineTransition.inputColor" = "복사기 빛의 색상.";"CICopyMachineTransition.inputAngle" = "복사기 빛의 각도.";"CICopyMachineTransition.inputWidth" = "복사기 빛의 너비. ";"CICopyMachineTransition.inputOpacity" = "복사기 빛의 불투명도. 0.0의 값은 반투명입니다. 1.0의 값은 불투명입니다.";"CICopyMachineTransition.inputTime" = "변환의 매개변수 시간. 이 값은 시작(시간 0)에서 종료(시간 1)까지를 변환합니다.";"CIDisintegrateWithMaskTransition.inputMaskImage" = "소스에서 대상 이미지를 분리할 때 사용하는 모양을 정의하는 이미지.";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "마스크로 생성된 그림자의 반경.";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "마스크로 생성된 그림자의 밀도.";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "마스크로 생성된 그림자의 오프셋.";"CIDisintegrateWithMaskTransition.inputTime" = "변환의 매개변수 시간. 이 값은 시작(시간 0)에서 종료(시간 1)까지를 변환합니다.";"CIDissolveTransition.inputTime" = "변환의 매개변수 시간. 이 값은 시작(시간 0)에서 종료(시간 1)까지를 변환합니다.";"CIFlashTransition.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치."; "CIFlashTransition.inputExtent" = "플래시의 면적.";"CIFlashTransition.inputColor" = "플래시에서 터져 나오는 광선의 색상.";"CIFlashTransition.inputMaxStriationRadius" = "플래시에서 터져 나오는 광선의 반경.";"CIFlashTransition.inputStriationStrength" = "플래시에서 터져 나오는 광선의 강도.";"CIFlashTransition.inputStriationContrast" = "플래시에서 터져 나오는 광선의 대비.";"CIFlashTransition.inputFadeThreshold" = "플래시와 대상 이미지 사이의 페이드 정도. 해당 값이 크면, 플래시 시간은 더 걸리고 페이드 시간을 줄어듭니다.";"CIFlashTransition.inputTime" = "변환의 매개변수 시간. 이 값은 시작(시간 0)에서 종료(시간 1)까지를 변환합니다.";"CIModTransition.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치."; "CIModTransition.inputAngle" = "모드 홀 패턴의 각도.";"CIModTransition.inputRadius" = "패턴에 있는 왜곡되지 않은 홀의 반경.";"CIModTransition.inputCompression" = "모드 홀 패턴에 적용된 펼침 정도. 중앙에 있는 홀은 이미지 가장자리에 있는 홀만큼 많이 왜곡되지 않습니다.";"CIModTransition.inputTime" = "변환의 매개변수 시간. 이 값은 시작(시간 0)에서 종료(시간 1)까지를 변환합니다.";"CIPageCurlTransition.inputBacksideImage" = "대상 이미지를 드러내도록 페이지 말림 형태로, 소스 이미지 뒤쪽에 나타나는 이미지.";"CIPageCurlTransition.inputShadingImage" = "정사각형 이미지에 있는 음영이 있는 구처럼 보이는 이미지.";"CIPageCurlTransition.inputExtent" = "효과의 면적.";"CIPageCurlTransition.inputAngle" = "말리는 페이지의 각도.";"CIPageCurlTransition.inputRadius" = "말림 반경.";"CIPageCurlTransition.inputTime" = "변환의 매개변수 시간. 이 값은 시작(시간 0)에서 종료(시간 1)까지를 변환합니다.";"CIRippleTransition.inputShadingImage" = "정사각형 이미지에 있는 음영이 있는 구처럼 보이는 이미지.";"CIRippleTransition.inputCenter" = "효과의 중심으로 사용할 x 및 y 위치."; "CIRippleTransition.inputExent" = "효과의 면적.";"CIRippleTransition.inputWidth" = "파동의 너비.";"CIRippleTransition.inputScale" = "파동을 볼록한 부분에서 시작할지 아니면 오목한 부분에서 시작할지를 결정하는 값.";"CIRippleTransition.inputTime" = "변환의 매개변수 시간. 이 값은 시작(시간 0)에서 종료(시간 1)까지를 변환합니다.";"CISwipeTransition.inputExtent" = "효과의 면적.";"CISwipeTransition.inputColor" = "강타의 색상.";"CISwipeTransition.inputAngle" = "강타의 각도.";"CISwipeTransition.inputWidth" = "강타의 너비";"CISwipeTransition.inputOpacity" = "강타의 불투명도.";"CISwipeTransition.inputTime" = "변환의 매개변수 시간. 이 값은 시작(시간 0)에서 종료(시간 1)까지를 변환합니다.";"CIAreaHistogram" = "이미지에 있는 지정된 영역의 막대 그래프를 계산합니다, 1D 이미지로 결과를 반환합니다.";"CIAreaHistogram.inputExtent" = "처리하려는 이미지의 하위 영역을 지정하는 사각형.";"CIAreaHistogram.inputCount" = "막대 그래프에 대한 저장값의 수.";"CIAreaHistogram.inputImage" = "계산하려는 막대 그래프 이미지.";"CIAreaHistogram.inputScale" = "막대 그래프 값에 사용할 크기 값.";"CIAreaMaximum" = "이미지에 있는 지정된 영역의 최대 구성요소 값을 계산합니다, 픽셀로 결과를 반환합니다.";"CIAreaMaximum.inputExtent" = "처리하려는 이미지의 하위 영역을 지정하는 사각형.";"CIAreaMaximum.inputImage" = "처리하려는 이미지.";"CIAreaMinimum" = "이미지에 있는 지정된 영역의 최소 구성요소 값을 계산합니다, 픽셀로 결과를 반환합니다.";"CIAreaMinimum.inputExtent" = "처리하려는 이미지의 하위 영역을 지정하는 사각형.";"CIAreaMinimum.inputImage" = "처리하려는 이미지.";"CIAreaMaximumAlpha" = "최대 알파 값을 가진 픽셀을 찾아서 반환합니다.";"CIAreaMaximumAlpha.inputExtent" = "처리하려는 이미지의 하위 영역을 지정하는 사각형.";"CIAreaMaximumAlpha.inputImage" = "처리하려는 이미지.";"CIAreaMinimumAlpha" = "최소 알파 값을 가진 픽셀을 찾아서 반환합니다.";"CIAreaMinimumAlpha.inputExtent" = "처리하려는 이미지의 하위 영역을 지정하는 사각형.";"CIAreaMinimumAlpha.inputImage" = "처리하려는 이미지.";"CIAreaAverage" = "이미지에서 지정된 영역의 평균 색상을 계산합니다, 픽셀로 결과를 반환합니다.";"CIAreaAverage.inputExtent" = "처리하려는 이미지의 하위 영역을 지정하는 사각형.";"CIAreaAverage.inputImage" = "처리하려는 이미지.";"CIRowAverage" = "이미지에 있는 지정된 영역의 각각의 행에 대한 평균 색상을 계산합니다, 1D 이미지로 결과를 반환합니다.";"CIRowAverage.inputExtent" = "처리하려는 이미지의 하위 영역을 지정하는 사각형.";"CIRowAverage.inputImage" = "처리하려는 이미지.";"CIColumnAverage" = "이미지에 있는 지정된 영역의 각각의 열에 대한 평균 색상을 계산합니다, 1D 이미지로 결과를 반환합니다.";"CIColumnAverage.inputExtent" = "처리하려는 이미지의 하위 영역을 지정하는 사각형.";"CIColumnAverage.inputImage" = "처리하려는 이미지.";"CIMinimumComponent" = "세 가지 색상 구성요소의 최소값을 사용하여 이미지를 흑백음영으로 변환합니다.";"CIMinimumComponent.inputExtent" = "처리하려는 이미지의 하위 영역을 지정하는 사각형.";"CIMinimumComponent.inputImage" = "처리하려는 이미지.";"CIMaximumComponent" = "세 가지 색상 구성요소의 최대값을 사용하여 이미지를 흑백음영으로 변환합니다.";"CIMaximumComponent.inputExtent" = "처리하려는 이미지의 하위 영역을 지정하는 사각형.";"CIMaximumComponent.inputImage" = "처리하려는 이미지.";